name: "mixNet"
layer {
    name: "data"
    type: "Input"
    top: "data"
    input_param { shape: { dim: 8 dim: 1 dim: 1 dim: 2} }
}
layer {
    name: "ip1"
    type: "InnerProduct"
    bottom: "data"
    top: "ip1"
    param {
        lr_mult: 1    
    }
    param {
        lr_mult: 2
    }
    inner_product_param {
        num_output: 10
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
    }
}
layer {
    name: "relu1"
    type: "Relu"
    bottom: "ip1"
    top: "ip1"
}
layer {
    name: "ip2"
    type: "InnerProduct"
    bottom: "ip1"
    top: "ip2"
    param {
        lr_mult: 1
    }
    param {
        lr_mult: 2
    }
    inner_product_param {
        num_output: 2
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
    }
}
layer {
    name: "prop"
    type: "softmax"
    bottom: "ip2"
    top: "prop"
}
